app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "dds"], ["updated_at", "2018-09-23 22:08:51.302772"], ["id", 21]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(params.require(:post))